# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [2]:
#Your code here
cur.execute("""SELECT firstName, lastName FROM employees JOIN offices USING(officeCode) WHERE city = 'Boston';""")
cur.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [3]:
#Your code here
cur.execute("""SELECT city, count(*) FROM offices JOIN employees USING(officeCode) GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [4]:
# Answers will vary

Question 1: What is the most ordered product?

In [5]:
# Most ordered product
cur.execute('''SELECT productName, quantityOrdered FROM products JOIN orderdetails USING(productCode) ORDER BY quantityOrdered DESC LIMIT 1;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

          productName quantityOrdered
0  1969 Dodge Charger              97

Question 2: Which customer has spent the most money on orders?

In [6]:
# Customer that has spent the most money on orders
cur.execute('''SELECT customerName, amount FROM customers JOIN payments USING(customerNumber) ORDER BY amount DESC LIMIT 1;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

       customerName   amount
0  FunGiftIdeas.com  9977.85

Question 3: How much does the most expensive item that has been purchased cost? Also, what about the most expensive product available? Are they the same?

In [7]:
# Most expensive product purchased
cur.execute('''SELECT productName, buyPrice FROM products JOIN orderdetails USING(productCode) ORDER BY buyPrice DESC LIMIT 1;''').fetchall()

[('1952 Alpine Renault 1300', '98.58')]

In [8]:
# Most expensive product offered
cur.execute('''SELECT productName, priceEach FROM products JOIN orderdetails USING(productCode) ORDER BY priceEach DESC LIMIT 1;''').fetchall()

[('1996 Moto Guzzi 1100i', '99.91')]

## Level Up: Display the names of each product each employee has sold.

In [14]:
# Your code here
cur.execute('''SELECT firstName, lastName, productName
                      FROM employees e JOIN customers c on e.employeeNumber = c.salesRepEmployeeNumber
                      JOIN orders o USING(customerNumber)
                      JOIN orderdetails od USING(orderNumber)
                      JOIN products p USING(productCode);
                      ''')
df = pd.DataFrame(cur.fetchall())
df.head(20)

         0         1                                            2
0   Leslie  Jennings                               1958 Setra Bus
1   Leslie  Jennings                       1940 Ford Pickup Truck
2   Leslie  Jennings                      1939 Cadillac Limousine
3   Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4   Leslie  Jennings                            1968 Ford Mustang
5   Leslie  Jennings                           1968 Dodge Charger
6   Leslie  Jennings                      1970 Plymouth Hemi Cuda
7   Leslie  Jennings                           1969 Dodge Charger
8   Leslie  Jennings                  1948 Porsche 356-A Roadster
9   Leslie  Jennings                         1969 Dodge Super Bee
10  Leslie  Jennings                        1976 Ford Gran Torino
11  Leslie  Jennings                             1957 Vespa GS150
12  Leslie  Jennings                    1957 Corvette Convertible
13  Leslie  Jennings                      1982 Ducati 900 Monster
14  Leslie  Jennings                      1982 Lamborghini Diablo
15  Leslie  Jennings                    1971 Alpine Renault 1600s
16  Leslie  Jennings                      1956 Porsche 356A Coupe
17  Leslie  Jennings                        1961 Chevrolet Impala
18  Leslie  Jennings                            1982 Ducati 996 R
19  Leslie  Jennings                    1974 Ducati 350 Mk3 Desmo

## Level Up: Display the Number of Products each Employee Has sold

In [12]:
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!